Repository: openstack-archive/deb-congress
Catalog: debian/po/*.po
Languages: fr, pt

source: Authentication server hostname:
fr: Nom d'hôte du serveur d'authentification :
pt: Nome de maquina do servidor de autenticação:

source: Please specify the hostname of the authentication server for Congress. Typically this is also the hostname of the OpenStack Identity Service (Keystone).
fr: Veuillez indiquer le nom d'hôte du serveur d'authentification pour Congress. Typiquement, c'est également le nom d'hôte de votre service d'Identité OpenStack (Keystone).
pt: Por favor especifique o nome de máquina do servidor de autenticação para o Congress Tipicamente este é também o nome de máquina do Serviço de Identidade OpenStack (Keystone).

source: Authentication server tenant name:
fr: Serveur d'authentification pour l'espace client :
pt: Nome "tenant" do administrador de autenticação:

source: Please specify the authentication server tenant name.
fr: Veuillez indiquer le nom de l'espace client du serveur d’authentification.
pt: Por favor especifique o nome "tenant" do servidor de autenticação.

source: Authentication server username:
fr: Nom d'utilisateur du serveur d'authentification :
pt: Nome do utilizador do servidor de autenticação:

source: Please specify the username to use with the authentication server.
fr: Veuillez indiquer le nom d'utilisateur à utiliser sur le serveur d'authentification.
pt: Por favor especifique o nome de utilizador a usar com o servidor de autenticação.

source: Authentication server password:
fr: Mot de passe du serveur d'authentification :
pt: Palavra passe do servidor de autenticação:

source: Please specify the password to use with the authentication server.
fr: Veuillez indiquer le mot de passe à utiliser sur le serveur d'authentification.
pt: Por favor especifique a palavra passe a usar com o servidor de autenticação.

source: Set up a database for Congress?
fr: Installer une base de données pour Congress ?
pt: Configurar uma base de dados para o Congress?

source: No database has been set up for congress to use. Before continuing, you should make sure you have the following information:
fr: Aucune base de données n'a été installée pour Congress. Si vous voulez en installer une maintenant, assurez-vous d'avoir les informations suivantes :
pt: Nenhuma base de dados foi configurada para o congress usar. Antes de continuar, você deve certificar-se que tem a seguinte informação:

source: * the type of database that you want to use; * the database server hostname (that server must allow TCP connections from this machine); * a username and password to access the database.
fr: - le type de base de données que vous souhaitez utiliser ; - le nom d'hôte du serveur de base de données (ce serveur doit accepter les connexions TCP depuis cette machine) ; - un nom d'utilisateur et un mot de passe pour accéder à cette base de données.
pt: * o tipo de base de dados que deseja usar; * o nome de máquina do servidor da base de dados (esse servidor deve permitir ligações TCP a partir desta máquina); * um nome de utilizador e palavra passe para aceder à base de dados.

source: If some of these requirements are missing, do not choose this option and run with regular SQLite support.
fr: Si certains de ces prérequis sont manquants, ignorez cette option et exécutez l'application avec le support SQLite normal.
pt: Se alguns destes requerimentos estão em falta, não escolha esta opção e corra com suporte SQLite regular.

source: You can change this setting later on by running "dpkg-reconfigure -plow congress-common".
fr: Vous pouvez modifier ce réglage plus tard en lançant « dpkg-reconfigure -plow congress-common ».
pt: Você pode modificar estas definições mais tarde ao correr "dpkg-reconfigure -plow congress-common".

source: Register Congress in the Keystone endpoint catalog?
fr: Enregistrer Congress dans le catalogue de points d'accès Keystone ?
pt: Registar o Congress no catálogo de "endpoint" do Keystone?

source: Each OpenStack service (each API) should be registered in order to be accessible. This is done using "keystone service-create" and "keystone endpoint-create". This can be done automatically now.
fr: Chaque service OpenStack (chaque API) doit être enregistré pour être accessible. Cela peut être fait en utilisant « keystone service-create » et « keystone endpoint-create ». Cela peut être fait automatiquement maintenant.
pt: Cada serviço do OpenStack (cada API) deve ser registado de modo a ser acessível. Isto é feito usando "keystone service-create" e "keystone endpoint-create". Isto pode ser feito automaticamente agora.

source: Note that you will need to have an up and running Keystone server on which to connect using a known admin project name, admin username and password. The admin auth token is not used anymore.
fr: Veuillez noter que vous aurez besoin d'un serveur Keystone fonctionnel sur lequel se connecter en utilisant un nom d'administrateur de projet connu, ainsi qu'un nom d'utilisateur et un mot de passe. Le jeton d'authentification n'est plus utilisé.
pt: Note que irá precisar de ter um servidor Keystone a funcionar no qual ligar usando um nome de projecto admin conhecido, nome de utilizador e palavra passe admin. O token de autenticação admin não é mais utilizado.

source: Keystone server IP address:
fr: Adresse IP du serveur Keystone :
pt: Endereço IP do servidor Keystone:

source: Please enter the IP address of the Keystone server, so that congress-server can contact Keystone to do the Congress service and endpoint creation.
fr: Veuillez indiquer l'adresse IP du serveur Keystone, pour que le serveur Congress puisse contacter Keystone pour établir le service Congress et créer le point d'accès.
pt: Por favor indique o endereço IP do servidor Keystone, para que o congress-server possa contactar o Keystone para fazer o serviço Congress e a criação do "endpoint".

source: Keystone admin name:
fr: Nom d'utilisateur pour Keystone :
pt: Nome de administrador do Keystone:

source: To register the service endpoint, this package needs to know the Admin login, name, project name, and password to the Keystone server.
fr: Pour enregistrer le point d'accès du service, le paquet a besoin de l'identifiant de l'administrateur, le nom du projet et le mot de passe du serveur Keystone.
pt: Para registar o endpoint do serviço, este pacote precisa de saber o login de Admin, o nome, nome do projecto e palavra passe para o servidor Keystone.

source: Keystone admin project name:
fr: Nom d'administrateur du projet Keystone :
pt: Nome do projecto admin do Keystone:

source: Keystone admin password:
fr: Mot de passe de l'administrateur de Keystone :
pt: Palavra passe admin do Keystone:

source: Congress endpoint IP address:
fr: Adresse IP du point d'accès Congress :
pt: Endereço IP endpoint do Congress:

source: Please enter the IP address that will be used to contact Congress.
fr: Veuillez indiquer l'adresse IP qui sera utilisée pour contacter Congress.
pt: Por favor indique o endereço IP que será usado para contactar o Congress.

source: This IP address should be accessible from the clients that will use this service, so if you are installing a public cloud, this should be a public IP address.
fr: Cette adresse IP doit être accessible depuis les clients qui utiliseront ce service, donc si vous installez un nuage public, ce devra être une adresse IP publique.
pt: Este endereço IP deve estar acessível a partir dos clientes que irão usar este serviço, portanto se está a instalar uma cloud pública, este deve ser um endereço IP público.

source: Name of the region to register:
fr: Nom de la région à enregistrer :
pt: Nome da região a registar:

source: OpenStack supports using availability zones, with each region representing a location. Please enter the zone that you wish to use when registering the endpoint.
fr: OpenStack prend en charge l'utilisation de zones disponibles, avec chaque région représentant un lieu. Veuillez entrer une zone que vous souhaitez utiliser lors de l'enregistrement d'un point d'accès.
pt: O OpenStack suporta a utilização de zonas de disponibilidade, com cada região a representar uma local. Por favor indique a zona que deseja usar quando registar o "endpoint".
